const regExEmail = '^(([^<>()[\\]\\\\.,;:\\s@"]+(\\.[^<>()[\\]\\\\.,;:\\s@"]+)*)|(".+"))@((\\[[0-9]{1,3}\\' +
    '.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\])|(([\\-a-zA-Z0-9]+\\.)+[a-zA-Z]{2,}))$';

// Расшифровка регулярки:
/*^(
    (
        [^<>()[\]\\.,;:\s@"]+          - один или более символ, кроме указанных
            (\. - точка
            [^<>()[\]\\.,;:\s@"]+      - один или более символ, кроме указанных
                )
                *                      - ноль или более
                )
                |                      - ИЛИ
                (".+")                 - один или более символ в двойных кавычках
                )
                @                      - символ `@`
                (
                (
                \[                     - открывающая квадратная скобка
                [0-9]{1,3}             - от 1 до 3 цифр
                \.                     - точка
                [0-9]{1,3}
                \.
                [0-9]{1,3}
                \.
                [0-9]{1,3}
                \]                      - закрывающая квадратная скобка
                )
                |                       - ИЛИ
                (
                (
                [\-a-zA-Z0-9]+          - символ `-`, одна или более буква латиницы, цифра
                \.                      - точка
                )+                      - один или более
                [a-zA-Z]{2,}            - хотя бы `2` буквы латиницы
                )
                ) */

export {
    regExEmail,
};
